## staging: create_metrics_lambda
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 13 to add, 1 to change, 9 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_api_gateway_integration.metrics will be updated in-place
  ~ resource "aws_api_gateway_integration" "metrics" {
        id                      = "agi-rpjvmf2ukd-v2izi2-POST"
      ~ uri                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:005133826942:function:save-metrics/invocations" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.metrics must be replaced
-/+ resource "aws_cloudwatch_log_group" "metrics" {
      ~ arn               = "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/lambda/save-metrics" -> (known after apply)
      ~ id                = "/aws/lambda/save-metrics" -> (known after apply)
      ~ name              = "/aws/lambda/save-metrics" -> "/aws/lambda/create_metrics" # forces replacement
      - tags              = {} -> null
      ~ tags_all          = {} -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_cloudwatch_metric_alarm.create_metrics_average_duration must be replaced
-/+ resource "aws_cloudwatch_metric_alarm" "create_metrics_average_duration" {
      ~ alarm_description                     = "This metric monitors average duration for the save_metrics lambda" -> "This metric monitors average duration for the create_metrics lambda"
      ~ alarm_name                            = "save-metrics-average-duration" -> "create-metrics-average-duration" # forces replacement
      ~ arn                                   = "arn:aws:cloudwatch:ca-central-1:005133826942:alarm:save-metrics-average-duration" -> (known after apply)
      - datapoints_to_alarm                   = 0 -> null
      ~ dimensions                            = {
          ~ "FunctionName" = "save-metrics" -> "create_metrics"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      - extended_statistic                    = "p99" -> null
      ~ id                                    = "save-metrics-average-duration" -> (known after apply)
      - insufficient_data_actions             = [] -> null
      - ok_actions                            = [] -> null
      + statistic                             = "Average"
      - tags                                  = {} -> null
      ~ tags_all                              = {} -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.create_metrics_dynamodb_wcu[0] must be replaced
-/+ resource "aws_cloudwatch_metric_alarm" "create_metrics_dynamodb_wcu" {
      ~ alarm_description                     = "This metric monitors maximum write capacity units for the raw_metrics table" -> "This metric monitors maximum write capacity units for the create_metrics table"
      ~ alarm_name                            = "raw-metrics-dynamodb-wcu" -> "create-metrics-dynamodb-wcu" # forces replacement
      ~ arn                                   = "arn:aws:cloudwatch:ca-central-1:005133826942:alarm:raw-metrics-dynamodb-wcu" -> (known after apply)
      - datapoints_to_alarm                   = 0 -> null
      + evaluate_low_sample_count_percentiles = (known after apply)
      ~ id                                    = "raw-metrics-dynamodb-wcu" -> (known after apply)
      - insufficient_data_actions             = [] -> null
      - ok_actions                            = [] -> null
      - tags                                  = {} -> null
      ~ tags_all                              = {} -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_iam_policy.create_metrics_put must be replaced
-/+ resource "aws_iam_policy" "create_metrics_put" {
      ~ arn       = "arn:aws:iam::005133826942:policy/CovidAlertRawMetricsPutItem" -> (known after apply)
      ~ id        = "arn:aws:iam::005133826942:policy/CovidAlertRawMetricsPutItem" -> (known after apply)
      ~ name      = "CovidAlertRawMetricsPutItem" -> "CovidAlertCreateMetricsPutItem" # forces replacement
      ~ policy_id = "ANPAQCMP77N7K4ZF73S6G" -> (known after apply)
      - tags      = {} -> null
      ~ tags_all  = {} -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_iam_policy.vpc_networking will be created
  + resource "aws_iam_policy" "vpc_networking" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "CovidAlertVplNetworking"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DeleteNetworkInterface",
                          + "ec2:CreateNetworkInterface",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ec2:ca-central-1:005133826942:network-interface/*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_policy.write_logs will be created
  + resource "aws_iam_policy" "write_logs" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "CovidAlertLogWriter"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role.create_metrics must be replaced
-/+ resource "aws_iam_role" "create_metrics" {
      ~ arn                   = "arn:aws:iam::005133826942:role/save-metrics.role" -> (known after apply)
      ~ assume_role_policy    = jsonencode( # whitespace changes
            {
                Statement = [
                    {
                        Action    = "sts:AssumeRole"
                        Effect    = "Allow"
                        Principal = {
                            Service = "lambda.amazonaws.com"
                        }
                        Sid       = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ create_date           = "2021-02-04T20:16:01Z" -> (known after apply)
      ~ id                    = "save-metrics.role" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::005133826942:policy/CovidAlertRawMetricsPutItem",
          - "arn:aws:iam::005133826942:policy/save-metrics",
        ] -> (known after apply)
      ~ name                  = "save-metrics.role" -> "create_lambda_role" # forces replacement
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROAQCMP77N7BRNGR24JT" -> (known after apply)
        # (3 unchanged attributes hidden)

      - inline_policy {}
      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.create_metrics_log_writer will be created
  + resource "aws_iam_role_policy_attachment" "create_metrics_log_writer" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "create_lambda_role"
    }

  # aws_iam_role_policy_attachment.createmetrics_dynamodb_put must be replaced
-/+ resource "aws_iam_role_policy_attachment" "createmetrics_dynamodb_put" {
      ~ id         = "save-metrics.role-arn:aws:iam::005133826942:policy/CovidAlertRawMetricsPutItem" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::005133826942:policy/CovidAlertRawMetricsPutItem" -> (known after apply) # forces replacement
      ~ role       = "save-metrics.role" -> "create_lambda_role" # forces replacement
    }

  # aws_iam_role_policy_attachment.createmetrics_vpc_networking will be created
  + resource "aws_iam_role_policy_attachment" "createmetrics_vpc_networking" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "create_lambda_role"
    }

  # aws_lambda_function.create_metrics must be replaced
-/+ resource "aws_lambda_function" "create_metrics" {
      ~ arn                            = "arn:aws:lambda:ca-central-1:005133826942:function:save-metrics" -> (known after apply)
      - description                    = "Lambda function for collecting metrics records" -> null
      + filename                       = "/tmp/lambda_create_metric.js.zip"
      ~ function_name                  = "save-metrics" -> "create_metrics" # forces replacement
      ~ id                             = "save-metrics" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:005133826942:function:save-metrics/invocations" -> (known after apply)
      ~ last_modified                  = "2021-06-28T14:54:38.076+0000" -> (known after apply)
      - layers                         = [] -> null
      + publish                        = false
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:005133826942:function:save-metrics:$LATEST" -> (known after apply)
      ~ role                           = "arn:aws:iam::005133826942:role/save-metrics.role" -> (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_size               = 758 -> (known after apply)
      - tags                           = {} -> null
      ~ tags_all                       = {} -> (known after apply)
      ~ version                        = "$LATEST" -> (known after apply)
        # (7 unchanged attributes hidden)


      - timeouts {}

      ~ tracing_config {
          ~ mode = "PassThrough" -> (known after apply)
        }

      ~ vpc_config {
          ~ security_group_ids = [
              - "sg-068c55bbe207b9a2d",
            ] -> (known after apply)
          ~ vpc_id             = "vpc-06fbc7337b116cce1" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
        # (1 unchanged block hidden)
    }

  # aws_lambda_permission.apigw must be replaced
-/+ resource "aws_lambda_permission" "apigw" {
      ~ function_name = "arn:aws:lambda:ca-central-1:005133826942:function:save-metrics" -> "create_metrics" # forces replacement
      ~ id            = "AllowAPIGatewayInvoke" -> (known after apply)
      ~ source_arn    = "arn:aws:execute-api:ca-central-1:005133826942:rpjvmf2ukd/*/POST/save-metrics" -> "arn:aws:execute-api:ca-central-1:005133826942:rpjvmf2ukd/*/POST/create_metrics" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # aws_security_group.create_metrics_sg must be replaced
-/+ resource "aws_security_group" "create_metrics_sg" {
      ~ arn                    = "arn:aws:ec2:ca-central-1:005133826942:security-group/sg-068c55bbe207b9a2d" -> (known after apply)
      ~ id                     = "sg-068c55bbe207b9a2d" -> (known after apply)
      ~ ingress                = [] -> (known after apply)
      ~ name                   = "allow_lambda_to_s3" -> "create_metrics_sg" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "005133826942" -> (known after apply)
      + revoke_rules_on_delete = false
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
        # (3 unchanged attributes hidden)

      - timeouts {}
    }

Plan: 13 to add, 1 to change, 9 to destroy.

Changes to Outputs:
  ~ lambda_invoke_arn = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:005133826942:function:save-metrics/invocations" -> (known after apply)

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

Releasing state lock. This may take a few moments...

```

</details>